app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 3]]
---
  def update
    @song = Song.find(params[:id])